# BasisX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Frame..::..BasisX Property
Frame Class See Also
---
The first basis vector of the frame.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ BasisX { get; set; }
```

Visual Basic
---
```text
Public Property BasisX As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ BasisX {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Frame Class
Autodesk.Revit.DB Namespace